Repository: Thang2629/Techfix
Catalog: */TechFix.API/Resources/SharedResource.*.resx
Languages: vi

# LinkingUserCanNotRedeemKycPackage
source: You cannot redeem this package because you have Link KYC.
vi: Bạn không thể kích hoạt gói này vì bạn đã Link KYC

# CustomerUserCanNotRedeemKycPackage
source: Customer account cannot activate this package.
vi: Tài khoản customer không thể kích hoạt gói này

# InvalidSponsor
source: Sponsor is invalid.
vi: Người bảo trợ không hợp lệ.

source: Sponsor KYC is not approved.
vi: Người bảo trợ chưa được chấp thuận KYC.

# OverFreeTransactionLimit
source: Your transaction amount is over the limit.
vi: Vượt quá hạn mức chuyển.

# FeatureTemporarilyClosedUntilX
source: This feature is temporarily closed until {0}
vi: Tính năng này tạm thời ngưng hỗ trợ tới {0}
