Repository: Thang2629/Techfix
Catalog: */TechFix.API/Resources/SharedResource.*.resx
Languages: vi

# AmountCannotBeLessThanZero
source: Amount cannot be less than 0.
vi: Giá trị không được nhỏ hơn 0.

# AmountMustBeGreaterThanZero
source: Amount must be greater than 0.
vi: Giá trị phải lớn hơn 0.

# CannotUpdateInformationBeforeTheSystemIsReviewingKYC
source: Cannot update information because the system is reviewing KYC.
vi: Bạn không thể cập nhật thông tin cá nhân vào lúc này cho đến khi quá trình xác thực KYC kết thúc.

# YouCantDeleteOFSExchangeRateX
source: You can't delete OFS Exchange Rate {0}.
vi: Không thể xóa OFS Exchange Rate {0}.

source: Cart is empty.
vi: Giỏ hàng trống.

source: Cart not found.
vi: Không tìm thấy giỏ hàng.

source: Cart is not valid.
vi: Giỏ hàng không hợp lệ.

source: Commissions not found.
vi: Không tìm thấy thông tin.

# ConvertVLGPlusToUsdLimitWarning
source: Your account has reached its liquidity limit this month.
vi: Tài khoản của bạn đã đạt đến giới hạn chuyển đổi trong tháng.

source: Customer not found.
vi: Khách hàng không tìm thấy.

source: Email verification code is not valid.
vi: Mã xác thực Email không đúng.

# FeatureIsNotSupportYet
source: This feature is not supported yet.
vi: Tính năng này hiện không khả dụng.

source: Google verification code is not valid.
vi: Mã xác thực Google không đúng.

source: Hello
vi: Xin chào

source: Interest Rate is not found
vi: Không tìm thấy lãi suất

source: Email verification code is invalid.
vi: Mã xác thực Email của bạn không đúng.

source: Google verification code is invalid.
vi: Mã xác thực Google của bạn không đúng.

source: KYC not found.
vi: KYC không tồn tại.

source: KYC status is not valid.
vi: Trạng thái KYC không hợp lệ.

# MissingBankInfoWarning
source: This account has not updated banking information yet.
vi: Tài khoản này chưa được cập nhật thông tin tài khoản ngân hàng.

# NotEnoughVLGPlusToConvert
source: Your account is not enough VTP to make the conversion.
vi: Tài khoản của bạn không có đủ VTP để chuyển đổi

source: OFS has been sold out.
vi: OFS đã được bán hết.

source: Package has been DELETED.
vi: Gói hàng đã bị xóa.

source: Package has expired.
vi: Gói hàng đã hết hạn sử dụng.

source: Package not found.
vi: Không tìm thấy gói hàng.

source: Password is incorrect.
vi: Mật khẩu không đúng.

source: Phone number is already taken.
vi: Số điện thoại này đã được sử dụng.

source: Please enter the reason for reject.
vi: Vui lòng nhập lý do từ chối.

source: Please enter userName.
vi: Vui lòng nhập tên tài khoản.

source: Please reset your password.
vi: Vui lòng đặt lại mật khẩu.

source: Please try again.
vi: Vui lòng thử lại.

source: You cannot update your information because your KYC is in review.
vi: Không thể chỉnh sửa do thông tin cá nhân của bạn đang trong quá trình xử lý.

source: Redeem Code can't be empty.
vi: Redeem Code phải có giá trị.

source: Referral is not found.
vi: Không thể tìm thấy người giới thiệu.

source: Register Successfully.
vi: Đăng ký thành công.

source: Your account does not have permission to access.
vi: Tài khoản của bạn không có quyền truy cập.

# SavingAccountIsNotFound
source: Savings account is not found.
vi: Không tìm thấy tài khoản tiết kiệm.

source: SMS verification code is not valid.
vi: Mã xác thực SMS không đúng.

# SpammingRequestWarning
source: You have sent too many requests, please try again in a few minutes.
vi: Bạn đang gửi yêu cầu quá nhiều lần, vui lòng thử lại sau ít phút.

source: The amount must be equal or greater than $250 and equal or fewer than $9,999.
vi: Số tiền rút ra phải lớn hơn hoặc bằng 250$ và nhỏ hơn hoặc bằng $9,999.

source: The balance is not enough.
vi: Tài khoản không đủ.

source: The code is already used.
vi: Mã đã được sử dụng.

source: The code is not correct.
vi: Mã không đúng.

source: The link has expired.
vi: Link thiết lập lại mật khẩu đã hết thời gian hiệu lực.

source: The link is not valid.
vi: Mã kích hoạt không hợp lệ.

source: The PIN must have 6 digits.
vi: Mã PIN phải có đủ 6 ký tự

source: The user does not have email to recover password.
vi: Người dùng không có email để thực hiện khôi phục mật khẩu.

source: The user is not confirmed.
vi: Tài khoản chưa được kích hoạt.

# TheAmountIsNotEnoughToTransferMoney
source: The balance is not enough to transfer.
vi: Tài khoản của bạn không đủ để chuyển khoản.

source: The amount must be greater than 0.
vi: Giá trị phải lớn hơn 0

# TheAmountMustBeGreaterThanX
source: The amount must be greater than {0}.
vi: Giá trị phải lớn hơn {0}

# TheBankIsNotFound
source: The bank not found.
vi: Không tìm thấy thông tin ngân hàng.

source: The Exchange Rate not found.
vi: Không tìm thấy thông tin.

source: The Package is not found.
vi: Không tìm thấy thông tin.

source: This feature is only for Business account.
vi: Tính năng này dành riêng cho tài khoản doanh nghiệp.

source: This link is already in use.
vi: Link thiết lập lại mật khẩu đã được sử dụng.

source: This package is only for users who registered since 08/15/2021.
vi: Gói hàng này chỉ dành cho những tài khoản được tạo kể từ 15/08/2021.

source: This user has not been approved KYC.
vi: Người dùng này chưa hoàn tất KYC.

source: This feature exclusive to Business account.
vi: Tính năng này chỉ dành riêng cho tài khoản doanh nghiệp.

# UpgrateAccountToConvertWarning
source: Redeem at least one Business package before any conversions.
vi: Vui lòng nâng cấp tài khoản bằng gói Business bất kỳ trước khi thực hiện chuyển đổi.

source: User does not exist.
vi: Người dùng không tồn tại.

# EmailDoesNotExist
source: Email does not exist, Please register.
vi: Email không tồn tại, vui lòng đăng ký.

source: User is not found.
vi: Không thể tìm thấy người dùng.

source: Username or password is incorrect.
vi: Tên đăng nhập hoặc mật khẩu không đúng.

source: User not found.
vi: Tài khoản không tồn lại.

# WalletNotFound
source: Wallet address not found.
vi: Địa chỉ ví không tồn lại.

source: VLGCash Wallet not found.
vi: Không tìm thấy ví VLGCash.

source: VLGCoin Wallet not found.
vi: Không tìm thấy ví VLGCoin.

source: VLGOFS Wallet not found.
vi: Không tìm thấy ví VLGOFS.

# VLGPlusWalletNotFound
source: VTP Wallet not found.
vi: Không tìm thấy ví VLGPlus.

source: VLGShare Wallet not found.
vi: Không tìm thấy ví VLGShare.

source: You can only checkout up to $1000 every 24 hours.
vi: Bạn chỉ có thể thanh toán tối đa 1000$ mỗi 24 giờ.

source: You cannot withdraw more than $9,999 per week.
vi: Bạn không thế rút quá $9,999 một tuần.

source: You do not have enough money to pay.
vi: Bạn không đủ tiền để thanh toán.

# PleaseCreateAPINBeforeTrading
source: You don't have a PIN, please create a PIN before trading.
vi: Bạn phải thiết lập mã PIN trước khi tiến hành giao dịch.

# YouDontHaveEnoughVLGPlusToConvertOFS
source: You don't have enough VTP to convert OFS.
vi: Bạn không đủ VTP để chuyển đổi sang OFS.

source: You have not set the PIN.
vi: Bạn chưa thiết lập mã PIN.

source: You must finish KYC before doing this action.
vi: Bạn phải hoàn tất KYC để có thể thực hiện chức năng này.

source: You must set PIN before checkout.
vi: Bạn phải thiết lập mã PIN trước khi tiến hành thanh toán.

source: You must set PIN before convert.
vi: Bạn phải thiết lập mã PIN trước khi tiến hành chuyển đổi.

source: You must set PIN before transfers.
vi: Bạn phải thiết lập mã PIN trước khi chuyển khoản.

# YouCanOnlyConvertLessThanOrEqualToXVLGPlus
source: You can only convert less than or equal to {0} VTP.
vi: Bạn chỉ có thể chuyển đổi thấp hơn hoặc bằng {0} VTP.

# YouCanOnlySaveLessThanOrEqualToX
source: You can only save less than or equal to {0}.
vi: Bạn chỉ được phép gửi ít hơn hoặc bằng {0}.

source: You must save greater than 0.
vi: Số ký gửi phải lớn hơn 0.

source: Your account already enabled Email Authentication.
vi: Tài khoản của bạn đã kích hoạt bảo mật qua Email Authentication.

source: Your account already enabled Google Authentication.
vi: Tài khoản của bạn đã kích hoạt bảo mật qua Google Authentication.

source: Your account already enabled SMS Authentication.
vi: Tài khoản của bạn đã kích hoạt bảo mật qua SMS Authentication.

# YourAccountCantConvertVLGPlusToCash
source: Your account can't convert VLGPlus to VUSD. To make a transaction please redeem at least 1 business package.
vi: Tài khoản của bạn không thể chuyển VTP thành tiền mặt. Để có thể sử dụng chức năng này bạn phải kích hoạch ít nhất một gói doanh nghiệp.

source: Your account can't redeem this package.
vi: Loại tài khoản của bạn không thể kích hoạt mã này.

source: Your account does not have enough OFS to make a transaction.
vi: Tài khoản của bạn không đủ OFS để thực hiện giao dịch.

source: Your account has been locked because you entered the wrong code many times.
vi: Tài khoản của bạn đã bị khóa bởi vì bạn đã nhập sai mã PIN quá nhiều lần.

source: Your account has been set the PIN.
vi: Tài khoản của bạn đã được cập nhật mã PIN.

source: Your account is not ACTIVE.
vi: Tài khoản của bạn chưa được kích hoạt.

source: Your balance doesn't have enough cash.
vi: Tài khoản của bạn không đủ tiền.

source: Your email does not match any user in the system.
vi: Email của bạn chưa được đăng ký.

source: Your email has been verified already.
vi: Bạn đã hoàn tất xác thực email trước đây.

# YourKYCHasBeenSubmitted
source: Your KYC has been submitted. Please wait for the system to verify.
vi: KYC của bạn đã được gửi đi và đang được chờ xét duyệt, vui lòng đợi quá trình này hoàn tất.

source: Your KYC has been verified.
vi: KYC của bạn đã được xác thực.

source: Your password must be minimum 6 characters.
vi: Mật khẩu phải có ít nhất 6 ký tự.

# YourProfileWasVerifiedAndDisabledForUpdating
source: Your profile was verified and disabled for updating, please contact support team via email support@vlinkgroup.net if you want to update it.
vi: Thông tin của bạn đã được xác thực nên bạn không được phép sửa đổi, vui liên hệ bộ phận hỗ trợ qua email support@vlinkgroup.net nếu bạn cần cập nhật nó.

source: Your email is not confirmed yet.
vi: Email của bạn chưa được xác nhận.

source: Your verification code is required.
vi: Mã xác nhận là bắt buộc.

# YourAccountIsLocked
source: <p>Your account has been disabled. <br />You cannot log in to the VLINK META system because your account or activity contains one or more violations <a href='{0}/terms' class='text-info' target='_blank'>Terms of use and data privacy </a>of VLINK META. <br /> Read more at: <a href='{0}/terms' class='text-info' target='_blank'>{0}/terms</a> </p>
vi: <p>Tài khoản của bạn đã bị vô hiệu hoá. <br />Bạn không thể đăng nhập vào hệ thống VLINK META do tài khoản hoặc hoạt động của bạn có một hoặc nhiều dấu hiệu vi phạm <a href='{0}/terms' class='text-info' target='_blank'>Điều khoản sử dụng và bảo mật dữ liệu </a>của VLINK META. <br /> Xem thêm tại đây: <a href='{0}/terms' class='text-info' target='_blank'>{0}/terms</a> </p>

source: Invalid email format.
vi: Định dạng email không đúng.

source: User type is not valid.
vi: Loại người dùng không đúng.

# YourUsernameMustBeMinimumXCharacters
source: Your username must be minimum {0} characters.
vi: Tên tài khoản phải ít nhất {0} kí tự.

# UserPasswordMustBeMinimumXCharacters
source: Your password must be minimum {0} characters.
vi: Mật khẩu phải ít nhất {0} kí tự.

# UsernameXIsAlreadyTaken
source: Username {0} is already taken.
vi: Tên tài khoản {0} đã được sử dụng.

# EmailXIsAlreadyTaken
source: Email {0} is already taken.
vi: Email {0} đã được sử dụng.

source: Phone number must be numeric only.
vi: Số điện thoại chỉ được ở dạng số.

source: Please enter your email.
vi: Vui lòng nhập email.

# PasswordAndPasswordAgainAreNotSame
source: Password and PasswordAgain are not the same.
vi: Mật khẩu và Mật khẩu nhập lại không giống nhau.

source: Password can't be empty.
vi: Mật khẩu không thể trống.

source: Authentication type is not valid.
vi: Loại xác thực không đúng.

source: Item not found.
vi: Vật phẩm không tìm thấy.

source: This feature is only for users from package $100 and above.
vi: Tính năng này dành riêng cho người dùng ở gói $100 trở lên.

source: Page number must be greater than 0.
vi: Số trang phải lớn hơn 0.

source: Your account has been locked.
vi: Tài khoản của bạn đã bị khoá.

# ThePINIsIncorrectAndYourAccountWillBeLockedAfterXWrongEntry
source: The PIN is incorrect. Your account will be locked after {0} wrong entry.
vi: Mã PIN không đúng. Tài khoản của bạn sẽ bị khoá sau {0} lần nhập sai.

# YouCanOnlyTransferUpTo100VLGPlusPerDay
source: You can only transfer up to 100 VTP per day.
vi: Bạn chỉ có thể chuyển khoản tối đa 100 VTP mỗi ngày.

source: You cannot transfer to yourself.
vi: Bạn không thể tự chuyển cho chính bạn.

source: Sender must be different from receiver.
vi: Người gửi và người nhận phải khác nhau.

source: The amount is not enough to trade.
vi: Tài khoản không đủ để giao dịch.

source: You can't transfer to "Rookie business free" account.
vi: Bạn không thể chuyển khoản tới tài khoản tân binh doanh nghiệp miễn phí.

# TheBusinessAccountCanOnlyReceiveXVLGPlusPerUserDay
source: This Business account can only receive {0} VTP per user/day.
vi: Tài khoản doanh nghiệp chỉ có thể nhận {0} VTP mỗi người/ngày.

# YouCanOnlyTransferLessThanOrEqualToXVLGPlusForThisBusinessToday
source: You can only transfer less than or equal to {0} VTP for this Business today.
vi: Bạn chỉ có thể chuyển khoản thấp hơn hoặc bằng {0} VTP cho tài khoản doanh nghiệp này trong hôm nay.

source: This user has been confirmed.
vi: Tài khoản đã được xác thực.

# YourAccountWillBeLockedAfterXWrongEntry
source: Your account will be locked after {0} wrong entry.
vi: Tài khoản của bạn sẽ bị khoá sau {0} lần nhập sai.

# YouHaveRedeemedVlinkGratefulPackageBefore
source: You have redeemed "Vlink Grateful" package before. Notice that you can only redeem "Vlink Grateful" package ONCE.
vi: Bạn đã kích hoạt gói "Vlink Grateful" trước đây rồi. Xin hãy lưu ý rằng gói "Vlink Grateful" chỉ được dùng 1 lần.

source: "Vlink Grateful" package has been sold out.
vi: Gói "Vlink Grateful" đã bán hết.

# TheSystemOnlyHasXPackagesLeft
source: The system only has {0} {1} packages left.
vi: Hệ thống chỉ còn lại {0} gói {1}.

# YouCannotRedeemPackageSmallerThanX
source: You cannot redeem package smaller than {0}.
vi: Bạn không thể kích hoạt gói nhỏ hơn gói {0}.

# YouMustEnterANumberGreaterThanOrEqualToXOFSY
source: You must enter a number greater than or equal to {0} OFS ({1}).
vi: Bạn phải nhập lớn hơn hoặc bằng {0} OFS ({1}).

# YouCanOnlyBuyUpToXOFSYVLGPlus
source: You can only buy up to {0} OFS ({1} VTP).
vi: Bạn chỉ có thể mua tối đa {0} OFS ({1} VTP).

# YouCanOnlyBuyUpToX
source: You can only buy up to {0}.
vi: Bạn chỉ có thể mua tối đa {0}.

# YouCanOnlyConvertUpToXOFSYToken
source: You can only convert up to {0} OFS ({1} Token).
vi: Bạn chỉ có thể chuyển đổi tối đa {0} OFS ({1} Token).

source: InterestRate not found.
vi: Không tìm thấy thông tin.

source: Wallet type is required.
vi: Loại ví phải được gửi lên.

source: Wallet type is not valid.
vi: Loại ví không hợp lệ.

source: VLG Token Wallet not found.
vi: Không tìm thấy ví VLG Token.

source: Not exist any OFS Exchange Rate.
vi: Không có OFS Exchange Rate nào tồn tại.

source: The system has not found this user.
vi: Không tìm thấy người dùng này.

# ThankYouForYourInterestInOurService
source: Thank you for your interest in our services.
vi: Cảm ơn vì đã quan tâm đến dịch vụ của chúng tôi.

# NewPINHasBeenSentToYourEmailX
source: New PIN has been sent to your email ({0}).
vi: Mã PIN mới đã được gửi tới email của bạn ({0}).

# YouCantDeleteShareExchangeRateX
source: You can't delete Share Exchange Rate {0}.
vi: Bạn không thể xoá Share Exchange Rate {0}.

source: IP access denied.
vi: Địa chỉ IP bị từ chối.

source: Your email address has not been confirmed.
vi: Địa chỉ email của bạn chưa được xác thực.

# CryptocurrencyExchangeError
source: Cryptocurrency exchange is having an error, please try again later
vi: Sàn giao dịch tiền điện tử đang gặp lỗi, vui lòng thử lại sau ít phút

source: An error occurred while saving data. Please try again.
vi: Hệ thống đã xảy ra lỗi khi lưu dữ liệu. Xin vui lòng thử lại.

# PackageHasStock
source: {0} has only {1} in stock.
vi: {0} chỉ còn {1}.

# PackageIsOutOfStock
source: {0} is out of stock.
vi: {0} đã bán hết.

# HasVmmPackage
source: You have redeemed "Vlink Meta Package" package before. Notice that you can only redeem "Vlink Meta Package" package ONCE.
vi: Bạn đã kích hoạt gói "Vlink Meta Package" trước đây rồi. Xin hãy lưu ý rằng gói "Vlink Meta Package" chỉ được dùng 1 lần.

# ImageNotFound
source: Image does not found.
vi: Không tìm thấy hình ảnh.

# InvalidImageType
source: Image type is invalid.
vi: Nhóm hình ảnh không hợp lệ.

# ChildUserNotFound
source: Child user does not found
vi: User con không tồn tại

# ThisUserHasBeenAddCoDirectBonus
source: This user has been added co-direct sponsor
vi: User này đã được cài đặt chia sẽ lợi nhận trước đây.

source: Total Percent Not Equal 100.
vi: Tổng phần trăm bắt buộc phải bằng 100

source: You Are Not Referral This User
vi: Bạn không phải là người bảo trợ cho người dùng này.

source: The user is duplicate
vi: Những người dùng bạn chọn bị trùng lặp

source: Monthly interest is paid.
vi: Khoản vay hàng tháng đã được trả.

# MonthlyInterestNotFound
source: Monthly interest does not found.
vi: Khoản vay hàng tháng không tìm thấy.

# RequestAmountReachMaxAmountCreditLending
source: You can only borrow up to {0} VTP.
vi: Bạn chỉ được vay tối đa {0} VTP.

# UserHasBadDebt
source: You have bad debt.
vi: Tài khoản đang bị nợ xấu.

# UserNotAllowCreditLending
source: The program only applies to users who have activated the package >= 10k and own VLG Token Staking.
vi: Chương trình chỉ áp dụng cho những user đã kích hoạt gói >= 10k và có VLG Token Staking.

# UserReachMaxAmountCreditLending
source: Your loan reach the maximum credit lending policy.
vi: Khoản nợ vượt quá quy định.

# PaymentCodeNotFound
source: Payment code does not found.
vi: Không tìm thấy mã thanh toán.

# Ranking2ChildrenTitleCondition
source: 2 {0} from 2 Legs from any levels.
vi: Danh hiệu 2 {0} từ bất kỳ tầng nào thuộc 2 nhánh riêng biệt.

# RankingDirectAgentCondition
source: 5 AGENTs directly.
vi: 5 AGENT trực tiếp F1.

# RankingMinChildrenTitleCondition
source: {0} {1} in {0} Legs from any levels
vi: {0} {1} từ bất kì tầng nào thuộc 2 nhánh riêng biệt.

# RankingMinTotalAp
source: AP in your direct and indirect leg team sale {0} AP.
vi: Tổng doanh số AP trong hệ thống trực tiếp và gián tiếp {0} AP.

# RankingPersonalSaleCondition
source: F1 direct sales: {0} AP Calculated in 1 quarter.
vi: Doanh số trực tiếp F1 {0} AP Trong 1 quý.

# RankingDirectAgentConditionBeforeX
source: 5 AGENTs directly before {0}.
vi: 5 AGENT trực tiếp F1 trước {0}.

# PackageHasBeenDiscontinued
source: The package {0} has been discontinued. Please clear your cart and checkout again.
vi: Gói {0} đã ngừng kinh doanh. Vui lòng xóa khỏi giỏ hàng và thanh toán lại.

# InvalidPackageAllowCreditLending
source: The account has not been supported loan yet.
vi: Tài khoản không được hỗ trợ vay.

# ReceiverIsInvalid
source: Your account can only transfer VLG to users who have activated the Business package. In order to be able to deliver VLG to all users, please activate any package.
vi: Tài khoản của bạn chỉ có thể chuyển VLG tới những user đã kích hoạt gói Business. Để có thể chuyển VLG tới mọi user, xin vui lòng kích hoạt một gói bất kì.

# MaxPreOrderItem
source: Each account can only deposit {0} product.
vi: Mỗi người dùng chỉ được đặt cọc {0} sản phẩm.

# DirectApMonthly
source: {0} Direct sales every month .
vi: Doanh số F1 trực tiếp {0} AP mỗi tháng

# CanNotPayPreOrderProduct
source: You can't pay for this product.
vi: Không thể thanh toán sản phẩm này.

# PreOrderPaymentExpired
source: Your payment has expired.
vi: Đã quá thời hạn thanh toán.

# YouMustSetPINBeforePreOrder
source: You must set PIN before order.
vi: Bạn phải thiết lập mã PIN trước khi đặt hàng.

source: You must set PIN before borrow.
vi: Bạn phải thiết lập mã PIN trước khi tiến hành vay.

# PendingCheckoutByVlg
source: This payment method is temporarily closed for maintenance. Please choose another payment method.
vi: Phương thức thanh toán này tạm thời bị đóng để bảo trì. Vui lòng chọn phương thức thanh toán khác.

source: Please setup PIN before doing this action.
vi: Vui lòng thiết lập mã PIN trước khi thực hiện hành động này.

# PackageHasBeenSoldOut
source: "{0}" package has been sold out.
vi: Gói "{0}" đã được bán hết.

# EventTicketCodeNotValid
source: The code is not valid.
vi: Mã của bạn không hợp lệ.

# EventTicketIsNotValid
source: This ticket is not valid
vi: Vé không hợp lệ.

# EventTicketIsUsed
source: This ticket is already used
vi: Vé đã được sử dụng.

# UpdateTicketInfoSuccess
source: Update ticket information successfully.
vi: Cập nhật thông tin vé thành công.

# AssignTicketSuccess
source: Give ticket successfully.
vi: Tặng vé thành công.

# ShoppingCartPaymentMethodIsInvalid
source: Shopping cart does not support this payment method.
vi: Giỏ hàng không hỗ trợ phương thức thanh toán này.

# CreditCardInvalid
source: Credit Card is invalid.
vi: Credit Card không hợp lệ.

# PackageQuantityMustLagerThan0
source: The package quantity must larger than 0.
vi: Số lượng phải lớn hơn 0.

# PreOrderProductNotFound
source: Pre-order does not found.
vi: Không tìm thấy Pre-order.

source: Post is not found.
vi: Không tìm thấy bài viết.

source: Receiver not found
vi: Người nhận không tồn tại trong hệ thống

# usernameMustBeLessThanXCharacters
source: Username must be less than {0} characters
vi: Tên đăng nhập phải ít hơn {0} kí tự

# OnlyForUserNotActiveYet
source: This package is only for those who have not activated any package yet
vi: Gói này chỉ dành cho những người dùng chưa kích hoạt gói nào

# CantRedeemForMmfUser
source: You can't redeem this package because you already active a Vlinkmeta Mall Founders package
vi: Bạn không thể kích hoạt gói này vì bạn đã từng kích hoạt gói Vlinkmeta Mall Founders

# FromWalletMatchToWallet
source: From wallet must not be To wallet.
vi: Không thể chuyển token cùng ví.

# ConvertVlgToVtpInvalidPackage
source: Please redeem at least on package of VMM, VMF, Business Pro, Platinum, Bronze to unlock this feature.
vi: Redeem ít nhất 1 gói thuộc VMM, VMF, Business Pro, Platinum, Bronze để mở khóa tính năng này.

# ReachWeeklyMaximumSwap
source: Your swap amount reachs maximum limitation.
vi: Vượt quá giới hạn chuyển đổi tuần này.

# MinSwapAmountIsOne
source: The minimum swap amount is 1.
vi: Số tiền chuyển đổi tối thiểu là 1.

# CantRedeemBecauseYouAreVmf
source: You can't redeem this package because you have activated the Vlinkmeta Mall Founders package
vi: Bạn không thể kích hoạt gói này bởi vì bạn đã từng kích hoạt gói Vlinkmeta Mall Founders

# TransferToVioNotAllowCustomerType
source: Can not make transfer.
vi: Không thể thực hiện giao dịch.

# RequiredKYCWhenUserSwap
source: You must complete KYC to use this feature
vi: Bạn phải hoàn thành KYC trước khi sử dụng tính năng này

# UserTypeApproveLinkKYCInvalid
source: Your account type must be Merchant or Affiliate to do this action.
vi: Tài khoản phải là Merchant hoặc Affiliate để thực hiện chức năng này.

# OutOfLinkKYCQuantity
source: You are out of link KYC quantity.
vi: Tài khoản đã hết lượt liên kết KYC.

# LinkingKycCannotDoThisAction
source: The user has the linking kyc can not do this action.
vi: Tài khoản đã link kyc không thể thực hiện thao tác này.

# SponsorNotHasKycPackage
source: Sponsor does not redeem KYC package.
vi: Tài khoản chỉ định chưa kích hoạt gói KYC.

# LinkKycHasBeenSubmitted
source: Your KYC Link request has been sent and is pending approval, please wait for the process to complete.
vi: Yêu cầu Link KYC của bạn đã được gửi đi và đang được chờ xét duyệt, vui lòng đợi quá trình này hoàn tất.
